import 'package:firztair_by_theejutha/quiz_model.dart';

List<QuizModel> questions = [
  QuizModel(
    "ทำไมจึงควรใช้แรงกดลงบนบาดแผลที่มีเลือดไหล ?",
    {
      "เพื่อหยุดหรือชะลอการไหลของเลือด และช่วยให้เลือดเป็นลิ่มเลือด": true,
      "เพื่อลดความเจ็บปวดและลดความเสี่ยงของการติดเชื้อ": false,
      "ดูแลด้านจิตใจของผู้ที่ได้รับบาดเจ็บจากเลือดออก และหยุดเลือดให้พวกเขา":
          false,
    },
  ),
  QuizModel("การห้ามเลือดด้วยวิธี “Pad and Bandang” ใช้กับข้อใด ?", {
    "ใช้นิ้วกดบาดแผล": false,
    "เลือดออกอยู่ต่ำกว่าข้อพันของข้อศอกหรือข้อเข่า": true,
    "ใช้เครื่องมือเฉพาะรัดเหนือบาดแผล": false,
  }),
  QuizModel(
    "เพื่อให้ผู้ป่วยได้รับอากาศบริสุทธิ์ควรปฎิบัติอย่างไร ?",
    {
      "ผายปอดผู้ป่วย": false,
      "ใช้พัดช่วยพัดผู้ป่วย": false,
      "อย่าให้คนมุงล้อมผู้ป่วย": true,
    },
  ),
  QuizModel("วิธีปฐมพยาบาลผู้ป่วยไฟไหม้รุนแรง คือข้อใด", {
    "เจาะถุงน้ำที่พองบริเวณแผล เพื่อลดความร้อน": false,
    "ใช้ผ้าฆ่าเชื้อปิดแผลหลวมๆห้ามถูกน้ำ": true,
    "ใช้น้ำเย็นกดทุก 5 นาที เพื่อให้บริเวณไฟลวกเย็นลง": false,
  }),
  QuizModel("อาการผู้ป่วยที่กระดูกหัก คือข้อใด", {
    "ปวดศรีษะมาก": false,
    "แขนขามีอาการชา": false,
    "ปวด บวม ช้ำ บริเวณกระดูกหัก": true,
  }),
];
